src/Catalogs/ПравилаПроверкиОбъектов/ПравилаПроверкиОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПравилаПроверкиОбъектов</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ИнформационныеБазы</name>
      <description>Информационные базы</description>
    </items>
    <items>
      <name>Кластеры1С</name>
      <description>Кластеры 1С</description>
    </items>
    <items>
      <name>СУБД</name>
      <description>СУБД</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипРезультатаПроверки</name>
    <type>
      <types>EnumRef.ТипРезультатаПроверкиОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Кластеры1С/Кластеры1С.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Кластеры1С</name>
  <attributes>
    <name>АдресСервераАдминистрирования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортСервераАдминистрирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательЦентральногоСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольЦентральногоСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресКластера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортКластера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяАдминистратораКластера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольАдминистратораКластера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторКластера</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Защищен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Активен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетчикПотребленияРесурсов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПлатформы</name>
    <type>
      <types>CatalogRef.ВерсииПлатформы</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РабочиеСерверыКластера</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Порт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторРабочегоСервера</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/ПравилаПроверкиОбъектов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс


#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс


Функция ВыполнитьПроверкуОбъекта(Объект, Правило) Экспорт
	
	Если Правило = ЗаполнениеДанныхСУБД Тогда
		ПроверкаПройдена = Проверить_ЗаполнениеДанныхСУБД(Объект);		
	Иначе
		// TODO	
	КонецЕсли;
	
	Если ПроверкаПройдена Тогда
		ПроверкаСостоянияОбъектов.ЗаписатьРезультатПроверки(Объект, Правило, Истина);
	Иначе
		ПроверкаСостоянияОбъектов.ЗаписатьРезультатПроверки(Объект, Правило);
	КонецЕсли;
		
	Возврат ПроверкаПройдена;	
	
КонецФункции

Функция Проверить_ЗаполнениеДанныхСУБД(Объект) Экспорт
	
	ПроверяемыеРеквизиты = Новый Массив;
	ПроверяемыеРеквизиты.Добавить("ТипСУБД");
	ПроверяемыеРеквизиты.Добавить("ИмяАдминистратораСУБД");
	ПроверяемыеРеквизиты.Добавить("ПарольАдминистратораСУБД");
	ПроверяемыеРеквизиты.Добавить("ИмяСервера");
	ПроверяемыеРеквизиты.Добавить("Адрес");
	ПроверяемыеРеквизиты.Добавить("Порт");
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект, ПроверяемыеРеквизиты);
	
	Для Каждого Реквизит Из ПроверяемыеРеквизиты Цикл
		Если Не ЗначениеЗаполнено(ЗначенияРеквизитов[Реквизит]) Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
		
КонецФункции


// Проверить актуальность зарегистрированных баз.
// 
// Параметры:
//  Кластер - СправочникСсылка.Кластеры1С
//  ИдентификаторыБаз - УникальныйИдентификатор
Процедура Проверить_АктуальностьЗарегистрированныхБаз(Кластер, ИдентификаторыБаз) Экспорт
	
	// REF: Переделать в самостоятельную проверку - без параметра "ИдентификаторыБаз".
	Правило = РегистрацияИнформационнойБазы;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
						|	ИнформационныеБазы.Ссылка КАК ИнформационнаяБаза
						|ИЗ
						|	Справочник.ИнформационныеБазы КАК ИнформационныеБазы
						|ГДЕ
						|	НЕ ИнформационныеБазы.ИдентификаторБазы В (&ИдентификаторыБаз)
						|	И ИнформационныеБазы.Владелец = &Кластер1С";
	
	Запрос.УстановитьПараметр("Кластер1С",				Кластер);
	Запрос.УстановитьПараметр("ИдентификаторыБаз",	ИдентификаторыБаз);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		//@skip-check invocation-parameter-type-intersect
		//@skip-check property-return-type
		ПроверкаСостоянияОбъектов.ЗаписатьРезультатПроверки(Выборка.ИнформационнаяБаза, Правило);		
	КонецЦикла;
		
КонецПроцедуры

// Проверить доступность серверов.
Процедура Проверить_ДоступностьСерверов() Экспорт
	
	Правило = ДоступностьСервераАдминистрированияКластера;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
						|	Кластеры1С.Ссылка КАК Кластер1С,
						|	Кластеры1С.АдресСервераАдминистрирования КАК АдресСервераАдминистрирования,
						|	Кластеры1С.ПортСервераАдминистрирования КАК ПортСервераАдминистрирования
						|ИЗ
						|	Справочник.Кластеры1С КАК Кластеры1С
						|ГДЕ
						|	Кластеры1С.Активен";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
		
	Пока Выборка.Следующий() Цикл
		Попытка
			//@skip-check property-return-type
			АгентАдминистрирования = Новый АдминистрированиеСервера(Выборка.АдресСервераАдминистрирования,
														Выборка.ПортСервераАдминистрирования);
			Проверить_АвторизациюСервераАдминистрирования(АгентАдминистрирования);	
		Исключение
			//@skip-check invocation-parameter-type-intersect
			//@skip-check property-return-type
			ПроверкаСостоянияОбъектов.ЗаписатьРезультатПроверки(Выборка.Кластер1С, Правило);	
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Процедура Проверить_АвторизациюСервераАдминистрирования(АгентАдминистрирования) 
	//TODO: Реализация
КонецПроцедуры



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
